In [1]:
import pandas as pd
import numpy as np
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine

# ERD

![png](https://assets.codingdojo.com/boomyeah/company_209/chapter_3569/handouts/chapter3569_5431_sakila-db-model.png)

In [2]:
#create connection string
username='root'
password='Hjtsai$$1031'
db_name='sakila'
connection=f'mysql+pymysql://{username}:{password}@localhost/{db_name}'

In [3]:
#create an engine
engine=create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

# First Query

What query would you run to get all the customers inside city_id = 312? Your query should return the customers' first name, last name, email, address, and city.

In [5]:
q = """SELECT customer.first_name, customer.last_name, 
customer.email, address.address, address.address2, city.city
FROM city
JOIN address ON city.city_id = address.city_id
JOIN customer on address.address_id = customer.address_id
WHERE city.city_id = 312;"""
pd.read_sql(q, engine)

,first_name,last_name,email,address,address2,city
0,MATTIE,HOFFMAN,MATTIE.HOFFMAN@sakilacustomer.org,1497 Yuzhou Drive,,London
1,CECIL,VINES,CECIL.VINES@sakilacustomer.org,548 Uruapan Street,,London

# Second Query

What query would you run to get all comedy films? Note that the genre is called the category in this schema. Your query should return film title, description, release year, rating, and special features.

In [7]:
q = """
SELECT film.title, film.description, film.release_year, film.rating, film.special_features, 
category.name
FROM film
JOIN film_category ON film.film_id = film_category.film_id
JOIN category on film_category.film_id = category.category_id
WHERE category.name = 'comedy';
"""
pd.read_sql(q, engine)

,title,description,release_year,rating,special_features,name
0,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,G,Deleted Scenes,Comedy

# Third Query

What query would you run to get all the films that Johnny Lollobrigida was in? Your query should return the actor's last name, film title, and release year.

In [8]:
q = """
SELECT actor.last_name, film.title, film.release_year
FROM actor
JOIN film_actor ON actor.actor_id = film_actor.actor_id
JOIN film on film_actor.film_id = film.film_id
WHERE actor.last_name = 'Lollobrigida';
"""
pd.read_sql(q, engine)

       last_name                 title  release_year
0   LOLLOBRIGIDA          AMADEUS HOLY          2006
1   LOLLOBRIGIDA      BANGER PINOCCHIO          2006
2   LOLLOBRIGIDA      BONNIE HOLOCAUST          2006
3   LOLLOBRIGIDA           CHITTY LOCK          2006
4   LOLLOBRIGIDA  COMMANDMENTS EXPRESS          2006
5   LOLLOBRIGIDA     CONEHEADS SMOOCHY          2006
6   LOLLOBRIGIDA      DADDY PITTSBURGH          2006
7   LOLLOBRIGIDA       DAISY MENAGERIE          2006
8   LOLLOBRIGIDA         ENOUGH RAGING          2006
9   LOLLOBRIGIDA     ESCAPE METROPOLIS          2006
10  LOLLOBRIGIDA           FIRE WOLVES          2006
11  LOLLOBRIGIDA        FRONTIER CABIN          2006
12  LOLLOBRIGIDA     GOODFELLAS SALUTE          2006
13  LOLLOBRIGIDA    GRAIL FRANKENSTEIN          2006
14  LOLLOBRIGIDA        GROOVE FICTION          2006
15  LOLLOBRIGIDA          HALL CASSIDY          2006
16  LOLLOBRIGIDA          HEAVENLY GUN          2006
17  LOLLOBRIGIDA      KRAMER CHOCOLATE          2006
18  LOLLOBRIGIDA         LOVE SUICIDES          2006
19  LOLLOBRIGIDA      METAL ARMAGEDDON          2006
20  LOLLOBRIGIDA       PACIFIC AMISTAD          2006
21  LOLLOBRIGIDA      PATTON INTERVIEW          2006
22  LOLLOBRIGIDA            POCUS PULP          2006
23  LOLLOBRIGIDA   RIDGEMONT SUBMARINE          2006
24  LOLLOBRIGIDA   RINGS HEARTBREAKERS          2006
25  LOLLOBRIGIDA         SMILE EARRING          2006
26  LOLLOBRIGIDA    SOLDIERS EVOLUTION          2006
27  LOLLOBRIGIDA        STAR OPERATION          2006
28  LOLLOBRIGIDA        SUNRISE LEAGUE          2006

# Fourth Query

What query would you run to get the first and last names of all the actors in the movie titled c?

In [9]:
q = """
SELECT actor.last_name, actor.first_name
FROM actor
JOIN film_actor ON actor.actor_id = film_actor.actor_id
JOIN film on film_actor.film_id = film.film_id
WHERE film.title = "Bingo Talented";
"""
pd.read_sql(q, engine)

     last_name first_name
0        BRODY     GOLDIE
1         WRAY    CAMERON
2  MCCONAUGHEY       CARY
3        CHASE        JON
4         BALL      RENEE

# Fifth Query

What query would you run to get the customer_id associated with all payments greater than twice the average payment amount? (HINT: use 2* in your query to get twice the amount). Your result should include the customer id and the amount.

In [15]:
q = """
SELECT customer_id, amount
FROM payment
WHERE amount >  (SELECT AVG(amount) * 2 FROM payment);
"""
pd.read_sql(q, engine)

     customer_id  amount
0              1    9.99
1              2   10.99
2              3    8.99
3              3   10.99
4              3    8.99
..           ...     ...
852          595    9.99
853          595   10.99
854          597    8.99
855          599    9.99
856          599    8.99

[857 rows x 2 columns]

# Sixth Query

What query would you run to list the first and last names of the 5 customers who have the highest number(count) of payments? You can title the number of payments as num_payments.

In [18]:
q = """
SELECT customer.last_name, customer.first_name, count(payment_id) as num_payments
FROM customer
JOIN payment
ON customer.customer_id = payment.customer_id
GROUP BY payment.customer_id
ORDER BY num_payments DESC
LIMIT 5;
"""
pd.read_sql(q, engine)

  last_name first_name  num_payments
0      HUNT    ELEANOR            46
1      SEAL       KARL            45
2      DEAN     MARCIA            42
3      SHAW      CLARA            42
4   SANDERS      TAMMY            41